# Rpstr_SetValueReal

## Description
Set a real value from the VectorScript value repository.

```pascal
PROCEDURE Rpstr_SetValueReal(
				name  : STRING;
				value : REAL);
```

```python
def vs.Rpstr_SetValueReal(name, value):
    return None
```

## Parameters
|Name|Type|Description|
|---|---|---|
|name|STRING|The name of the value.|
|value|REAL|Set a value associated with the name in the VectorScript value repository.|

## Examples
```pascal
Rpstr_SetValueReal('Example', 1.0);
```
```python
import vs

# Set a real value from the VectorScript value repository.
name = 'Example'
value = 1.0

vs.Rpstr_SetValueReal(name, value)
```

## See Also
VS Functions:
Rpstr_RemoveValues
| Rpstr_RemoveValue
| Rpstr_GetValueBool
| Rpstr_SetValueBool
| Rpstr_GetValueInt
| Rpstr_SetValueInt
| Rpstr_GetValueReal
| Rpstr_SetValueReal
| Rpstr_GetValueStr
| Rpstr_SetValueStr

## Version
Availability: from Vectorworks 2012

## Category
* Utility